# CircularRefsForInstParams Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CircularRefsForInstParams Property
BuiltInFailures..::..FamilyFailures Class See Also
---
"Instance parameter '%1!s!' generates circular references."
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CircularRefsForInstParams { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CircularRefsForInstParams As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CircularRefsForInstParams {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace